Tekla Open API Reference for Tekla Structures 2025
Distance.ToString Method
 Creates a string representation of the distance.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
The string representation of the distance using CultureInfo.InvariantCulture.
Examples
 This example shows how to convert a Distance instance to a string.
using Tekla.Structures.Datatype;
public class Example
{
       public void Example1()
       {
           // For this demonstration, we'll format 300.2 millimeters.
           Distance distance = new Distance(300.2);
           // The default format uses the current unit type, current culture info and default number format.
           string formattedString = distance.ToString();
       }
}
See Also
Reference
Distance Structure
ToString Overload
Tekla.Structures.Datatype Namespace